Revit 2027 API
BuiltInFailures.RegenFailures.CannotRegenFamily Property
 Can't regenerate Family [Family Name]. Edit Family to modify it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotRegenFamily { get; }
Public Shared ReadOnly Property CannotRegenFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotRegenFamily {
	FailureDefinitionId^ get ();
}
static member CannotRegenFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace